Revit.Elements.Element.SafeInit(System.Action,System.Boolean)
Handling exceptions when calling the initializing function
init:
fromExistingElement:

Revit.Elements.Element.OverridesInView
Gets graphic overrides for an element in the view.

Revit.Elements.Element.IsHiddeninView(Revit.Elements.Views.View)
Identifies if the element has been permanently hidden in the view.
view:
Returns:

Revit.Elements.Element.Geometry
Returns all geometry associated with an element. Ignores transforms when used with linked elements.
List of geometry from the element

Revit.Elements.Element.GetGeometry(System.String)
Returns all geometry associated with an element. Ignores transforms when used with linked elements.
detailLevel: Detail level
Returns: List of geometry from the element

Revit.Elements.Element.InternalGeometry(System.Boolean,Autodesk.Revit.DB.ViewDetailLevel)
Extract the Revit GeometryObject's from a Revit Element
Returns:

Revit.Elements.Element.GetLocation
Returns an element's location
The element’s location